print('________________________________1_____________________________________________________________________')
salary = [2300, 1800.001, 5000, 1234.582, 7500.12]
print(sum(salary), len(salary))
print(round(sum(salary) /len(salary),2), 'средняя зарплата')
print(round(max(salary), 2),'макс зп')
print(round(min(salary), 2),'мин зп')
print('________________________________2_____________________________________________________________________')

names = ['вадим', 'вася', 'петя', 'денис']
zipped = zip(names, salary)
print(list(zipped))

print('________________________________3_____________________________________________________________________')

zipped_2 = zip(names, salary)
print(dict(zipped_2))

print('________________________________4_____________________________________________________________________')

zipped_3 = dict(zip(names, salary))
print(zipped_3['вадим'], ' -зп вадима')